In [1]:
import pandas as pd

# 加载 csv 和 tsv 数据

##### 加载 csv 数据

In [2]:
tips = pd.read_csv('./data/tips.csv')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [3]:
type(tips)

pandas.core.frame.DataFrame

##### 加载 tsv 数据

In [4]:
# sep参数指定tsv文件的列元素分隔符为\t，默认sep参数是,
china = pd.read_csv('./data/china.tsv', sep='\t')
china

   country continent  year   lifeExp         pop    gdpPercap
0    China      Asia  1952  44.00000   556263527   400.448611
1    China      Asia  1957  50.54896   637408000   575.987001
2    China      Asia  1962  44.50136   665770000   487.674018
3    China      Asia  1967  58.38112   754550000   612.705693
4    China      Asia  1972  63.11888   862030000   676.900092
5    China      Asia  1977  63.96736   943455000   741.237470
6    China      Asia  1982  65.52500  1000281000   962.421381
7    China      Asia  1987  67.27400  1084035000  1378.904018
8    China      Asia  1992  68.69000  1164970000  1655.784158
9    China      Asia  1997  70.42600  1230075000  2289.234136
10   China      Asia  2002  72.02800  1280400000  3119.280896
11   China      Asia  2007  72.96100  1318683096  4959.114854

In [5]:
type(china)

pandas.core.frame.DataFrame

# DataFrame 获取指定行列的数据

## DataFrame 行标签和列标签

In [6]:
china.index

RangeIndex(start=0, stop=12, step=1)

In [7]:
china.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

## loc函数获取指定行列的数据

##### 示例1：获取行标签为 1952, 1962, 1972 行的 country、pop、gdpPercap 列的数据

In [8]:
china_df = china.set_index('year')
china_df.loc[[1952, 1962, 1972], ['country', 'pop', 'gdpPercap']]

     country        pop   gdpPercap
year
1952   China  556263527  400.448611
1962   China  665770000  487.674018
1972   China  862030000  676.900092

##### 示例2：获取行标签为 1952, 1962, 1972 行的所有列的数据

In [9]:
china_df.loc[[1952, 1962, 1972]]

     country continent   lifeExp        pop   gdpPercap
year
1952   China      Asia  44.00000  556263527  400.448611
1962   China      Asia  44.50136  665770000  487.674018
1972   China      Asia  63.11888  862030000  676.900092

##### 示例3：获取所有行的 country、pop、gdpPercap 列的数据

In [10]:
china_df.loc[:, ['country', 'pop', 'gdpPercap']]

     country         pop    gdpPercap
year
1952   China   556263527   400.448611
1957   China   637408000   575.987001
1962   China   665770000   487.674018
1967   China   754550000   612.705693
1972   China   862030000   676.900092
1977   China   943455000   741.237470
1982   China  1000281000   962.421381
1987   China  1084035000  1378.904018
1992   China  1164970000  1655.784158
1997   China  1230075000  2289.234136
2002   China  1280400000  3119.280896
2007   China  1318683096  4959.114854

##### 示例4：获取行标签为 1957 行的所有列的数据

In [11]:
china_df.loc[1957]

country          China
continent         Asia
lifeExp         50.549
pop          637408000
gdpPercap      575.987
Name: 1957, dtype: object

##### 示例5：获取行标签为 1957 行的 lifeExp 列的数据

In [12]:
china_df.loc[[1957]]

     country continent   lifeExp        pop   gdpPercap
year
1957   China      Asia  50.54896  637408000  575.987001

## iloc函数获取指定行列的数据

##### 示例1：获取行位置为 0, 2, 4 行的 0、1、2 列的数据

In [30]:
china_df.iloc[[0, 2, 4], [0, 1, 2]]

     country continent   lifeExp
year
1952   China      Asia  44.00000
1962   China      Asia  44.50136
1972   China      Asia  63.11888

##### 示例2：获取行位置为 0, 2, 4 行的所有列的数据

In [31]:
china_df.iloc[[0, 2, 4]]

     country continent   lifeExp        pop   gdpPercap
year
1952   China      Asia  44.00000  556263527  400.448611
1962   China      Asia  44.50136  665770000  487.674018
1972   China      Asia  63.11888  862030000  676.900092

##### 示例3：获取所有行的列位置为 0、1、2 列的数据

In [32]:
china_df.iloc[:, [0, 1, 2]]

     country continent   lifeExp
year
1952   China      Asia  44.00000
1957   China      Asia  50.54896
1962   China      Asia  44.50136
1967   China      Asia  58.38112
1972   China      Asia  63.11888
1977   China      Asia  63.96736
1982   China      Asia  65.52500
1987   China      Asia  67.27400
1992   China      Asia  68.69000
1997   China      Asia  70.42600
2002   China      Asia  72.02800
2007   China      Asia  72.96100

##### 示例4：获取行位置为 1 行的所有列的数据

In [33]:
china_df.iloc[1]

country          China
continent         Asia
lifeExp         50.549
pop          637408000
gdpPercap      575.987
Name: 1957, dtype: object

##### 示例5：获取行位置为 1 行的列位置为 2 列的数据

In [34]:
china_df.iloc[[1], 2]

china_df.iloc[1, [2]]

china_df.iloc[1, 2]

50.54896

## loc和iloc的切片操作

##### 示例1：获取 china_df 中前三行的前三列的数据，分别使用上面介绍的loc和iloc实现

In [35]:
china_df.loc[1952:1962, 'country':'lifeExp']

     country continent   lifeExp
year
1952   China      Asia  44.00000
1957   China      Asia  50.54896
1962   China      Asia  44.50136

In [36]:
china_df.iloc[0:3, 0:3]

     country continent   lifeExp
year
1952   China      Asia  44.00000
1957   China      Asia  50.54896
1962   China      Asia  44.50136

## [] 语法获取指定行列的数据

##### 示例1：获取所有行的 country、pop、gdpPercap 列的数据

In [17]:
# 示例1：获取所有行的 country、pop、gdpPercap 列的数据
china_df[['country', 'pop', 'gdpPercap']]

     country         pop    gdpPercap
year
1952   China   556263527   400.448611
1957   China   637408000   575.987001
1962   China   665770000   487.674018
1967   China   754550000   612.705693
1972   China   862030000   676.900092
1977   China   943455000   741.237470
1982   China  1000281000   962.421381
1987   China  1084035000  1378.904018
1992   China  1164970000  1655.784158
1997   China  1230075000  2289.234136
2002   China  1280400000  3119.280896
2007   China  1318683096  4959.114854

##### 示例2：获取所有行的 pop 列的数据

In [18]:
china_df['pop']

year
1952     556263527
1957     637408000
1962     665770000
1967     754550000
1972     862030000
1977     943455000
1982    1000281000
1987    1084035000
1992    1164970000
1997    1230075000
2002    1280400000
2007    1318683096
Name: pop, dtype: int64

##### 示例3：获取前三行的数据

In [19]:
china_df[0:3]

     country continent   lifeExp        pop   gdpPercap
year
1952   China      Asia  44.00000  556263527  400.448611
1957   China      Asia  50.54896  637408000  575.987001
1962   China      Asia  44.50136  665770000  487.674018

##### 示例4：从第一行开始，每隔一行获取一行数据，一共获取3行

In [20]:
china_df[0:6:2]

     country continent   lifeExp        pop   gdpPercap
year
1952   China      Asia  44.00000  556263527  400.448611
1962   China      Asia  44.50136  665770000  487.674018
1972   China      Asia  63.11888  862030000  676.900092